Files already downloaded and verified
Files already downloaded and verified
==> Resuming from checkpoint..
Ratio of nonzero value :  1.0
Number of nonzero value :  2377024
Number of value 2377024
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
           QConv2d-1           [-1, 32, 32, 32]             864
      QBatchNorm2d-2           [-1, 32, 32, 32]              64
           QConv2d-3           [-1, 32, 32, 32]           1,024
      QBatchNorm2d-4           [-1, 32, 32, 32]              64
           QConv2d-5           [-1, 32, 32, 32]             288
      QBatchNorm2d-6           [-1, 32, 32, 32]              64
           QConv2d-7           [-1, 16, 32, 32]             512
      QBatchNorm2d-8           [-1, 16, 32, 32]              32
           QConv2d-9           [-1, 16, 32, 32]             512
     QBatchNorm2d-10           [-1, 16, 32, 32]              32
            Block-11           [-1, 16, 32, 32]               0
          QConv2d-12           [-1, 96, 32, 32]           1,536
     QBatchNorm2d-13           [-1, 96, 32, 32]             192
          QConv2d-14           [-1, 96, 32, 32]             864
     QBatchNorm2d-15           [-1, 96, 32, 32]             192
          QConv2d-16           [-1, 24, 32, 32]           2,304
     QBatchNorm2d-17           [-1, 24, 32, 32]              48
          QConv2d-18           [-1, 24, 32, 32]             384
     QBatchNorm2d-19           [-1, 24, 32, 32]              48
            Block-20           [-1, 24, 32, 32]               0
          QConv2d-21          [-1, 144, 32, 32]           3,456
     QBatchNorm2d-22          [-1, 144, 32, 32]             288
          QConv2d-23          [-1, 144, 32, 32]           1,296
     QBatchNorm2d-24          [-1, 144, 32, 32]             288
          QConv2d-25           [-1, 24, 32, 32]           3,456
     QBatchNorm2d-26           [-1, 24, 32, 32]              48
            Block-27           [-1, 24, 32, 32]               0
          QConv2d-28          [-1, 144, 32, 32]           3,456
     QBatchNorm2d-29          [-1, 144, 32, 32]             288
          QConv2d-30          [-1, 144, 16, 16]           1,296
     QBatchNorm2d-31          [-1, 144, 16, 16]             288
          QConv2d-32           [-1, 32, 16, 16]           4,608
     QBatchNorm2d-33           [-1, 32, 16, 16]              64
            Block-34           [-1, 32, 16, 16]               0
          QConv2d-35          [-1, 192, 16, 16]           6,144
     QBatchNorm2d-36          [-1, 192, 16, 16]             384
          QConv2d-37          [-1, 192, 16, 16]           1,728
     QBatchNorm2d-38          [-1, 192, 16, 16]             384
          QConv2d-39           [-1, 32, 16, 16]           6,144
     QBatchNorm2d-40           [-1, 32, 16, 16]              64
            Block-41           [-1, 32, 16, 16]               0
          QConv2d-42          [-1, 192, 16, 16]           6,144
     QBatchNorm2d-43          [-1, 192, 16, 16]             384
          QConv2d-44          [-1, 192, 16, 16]           1,728
     QBatchNorm2d-45          [-1, 192, 16, 16]             384
          QConv2d-46           [-1, 32, 16, 16]           6,144
     QBatchNorm2d-47           [-1, 32, 16, 16]              64
            Block-48           [-1, 32, 16, 16]               0
          QConv2d-49          [-1, 192, 16, 16]           6,144
     QBatchNorm2d-50          [-1, 192, 16, 16]             384
          QConv2d-51            [-1, 192, 8, 8]           1,728
     QBatchNorm2d-52            [-1, 192, 8, 8]             384
          QConv2d-53             [-1, 64, 8, 8]          12,288
     QBatchNorm2d-54             [-1, 64, 8, 8]             128
            Block-55             [-1, 64, 8, 8]               0
          QConv2d-56            [-1, 384, 8, 8]          24,576
     QBatchNorm2d-57            [-1, 384, 8, 8]             768
          QConv2d-58            [-1, 384, 8, 8]           3,456
     QBatchNorm2d-59            [-1, 384, 8, 8]             768
          QConv2d-60             [-1, 64, 8, 8]          24,576
     QBatchNorm2d-61             [-1, 64, 8, 8]             128
            Block-62             [-1, 64, 8, 8]               0
          QConv2d-63            [-1, 384, 8, 8]          24,576
     QBatchNorm2d-64            [-1, 384, 8, 8]             768
          QConv2d-65            [-1, 384, 8, 8]           3,456
     QBatchNorm2d-66            [-1, 384, 8, 8]             768
          QConv2d-67             [-1, 64, 8, 8]          24,576
     QBatchNorm2d-68             [-1, 64, 8, 8]             128
            Block-69             [-1, 64, 8, 8]               0
          QConv2d-70            [-1, 384, 8, 8]          24,576
     QBatchNorm2d-71            [-1, 384, 8, 8]             768
          QConv2d-72            [-1, 384, 8, 8]           3,456
     QBatchNorm2d-73            [-1, 384, 8, 8]             768
          QConv2d-74             [-1, 64, 8, 8]          24,576
     QBatchNorm2d-75             [-1, 64, 8, 8]             128
            Block-76             [-1, 64, 8, 8]               0
          QConv2d-77            [-1, 384, 8, 8]          24,576
     QBatchNorm2d-78            [-1, 384, 8, 8]             768
          QConv2d-79            [-1, 384, 8, 8]           3,456
     QBatchNorm2d-80            [-1, 384, 8, 8]             768
          QConv2d-81             [-1, 96, 8, 8]          36,864
     QBatchNorm2d-82             [-1, 96, 8, 8]             192
          QConv2d-83             [-1, 96, 8, 8]           6,144
     QBatchNorm2d-84             [-1, 96, 8, 8]             192
            Block-85             [-1, 96, 8, 8]               0
          QConv2d-86            [-1, 576, 8, 8]          55,296
     QBatchNorm2d-87            [-1, 576, 8, 8]           1,152
          QConv2d-88            [-1, 576, 8, 8]           5,184
     QBatchNorm2d-89            [-1, 576, 8, 8]           1,152
          QConv2d-90             [-1, 96, 8, 8]          55,296
     QBatchNorm2d-91             [-1, 96, 8, 8]             192
            Block-92             [-1, 96, 8, 8]               0
          QConv2d-93            [-1, 576, 8, 8]          55,296
     QBatchNorm2d-94            [-1, 576, 8, 8]           1,152
          QConv2d-95            [-1, 576, 8, 8]           5,184
     QBatchNorm2d-96            [-1, 576, 8, 8]           1,152
          QConv2d-97             [-1, 96, 8, 8]          55,296
     QBatchNorm2d-98             [-1, 96, 8, 8]             192
            Block-99             [-1, 96, 8, 8]               0
         QConv2d-100            [-1, 576, 8, 8]          55,296
    QBatchNorm2d-101            [-1, 576, 8, 8]           1,152
         QConv2d-102            [-1, 576, 4, 4]           5,184
    QBatchNorm2d-103            [-1, 576, 4, 4]           1,152
         QConv2d-104            [-1, 160, 4, 4]          92,160
    QBatchNorm2d-105            [-1, 160, 4, 4]             320
           Block-106            [-1, 160, 4, 4]               0
         QConv2d-107            [-1, 960, 4, 4]         153,600
    QBatchNorm2d-108            [-1, 960, 4, 4]           1,920
         QConv2d-109            [-1, 960, 4, 4]           8,640
    QBatchNorm2d-110            [-1, 960, 4, 4]           1,920
         QConv2d-111            [-1, 160, 4, 4]         153,600
    QBatchNorm2d-112            [-1, 160, 4, 4]             320
           Block-113            [-1, 160, 4, 4]               0
         QConv2d-114            [-1, 960, 4, 4]         153,600
    QBatchNorm2d-115            [-1, 960, 4, 4]           1,920
         QConv2d-116            [-1, 960, 4, 4]           8,640
    QBatchNorm2d-117            [-1, 960, 4, 4]           1,920
         QConv2d-118            [-1, 160, 4, 4]         153,600
    QBatchNorm2d-119            [-1, 160, 4, 4]             320
           Block-120            [-1, 160, 4, 4]               0
         QConv2d-121            [-1, 960, 4, 4]         153,600
    QBatchNorm2d-122            [-1, 960, 4, 4]           1,920
         QConv2d-123            [-1, 960, 4, 4]           8,640
    QBatchNorm2d-124            [-1, 960, 4, 4]           1,920
         QConv2d-125            [-1, 320, 4, 4]         307,200
    QBatchNorm2d-126            [-1, 320, 4, 4]             640
         QConv2d-127            [-1, 320, 4, 4]          51,200
    QBatchNorm2d-128            [-1, 320, 4, 4]             640
           Block-129            [-1, 320, 4, 4]               0
         QConv2d-130           [-1, 1280, 4, 4]         409,600
    QBatchNorm2d-131           [-1, 1280, 4, 4]           2,560
         QLinear-132                  [-1, 100]         128,100
     MobileNetV2-133                  [-1, 100]               0
         QConv2d-134           [-1, 32, 32, 32]             864
    QBatchNorm2d-135           [-1, 32, 32, 32]              64
         QConv2d-136           [-1, 32, 32, 32]           1,024
    QBatchNorm2d-137           [-1, 32, 32, 32]              64
         QConv2d-138           [-1, 32, 32, 32]             288
    QBatchNorm2d-139           [-1, 32, 32, 32]              64
         QConv2d-140           [-1, 16, 32, 32]             512
    QBatchNorm2d-141           [-1, 16, 32, 32]              32
         QConv2d-142           [-1, 16, 32, 32]             512
    QBatchNorm2d-143           [-1, 16, 32, 32]              32
           Block-144           [-1, 16, 32, 32]               0
         QConv2d-145           [-1, 96, 32, 32]           1,536
    QBatchNorm2d-146           [-1, 96, 32, 32]             192
         QConv2d-147           [-1, 96, 32, 32]             864
    QBatchNorm2d-148           [-1, 96, 32, 32]             192
         QConv2d-149           [-1, 24, 32, 32]           2,304
    QBatchNorm2d-150           [-1, 24, 32, 32]              48
         QConv2d-151           [-1, 24, 32, 32]             384
    QBatchNorm2d-152           [-1, 24, 32, 32]              48
           Block-153           [-1, 24, 32, 32]               0
         QConv2d-154          [-1, 144, 32, 32]           3,456
    QBatchNorm2d-155          [-1, 144, 32, 32]             288
         QConv2d-156          [-1, 144, 32, 32]           1,296
    QBatchNorm2d-157          [-1, 144, 32, 32]             288
         QConv2d-158           [-1, 24, 32, 32]           3,456
    QBatchNorm2d-159           [-1, 24, 32, 32]              48
           Block-160           [-1, 24, 32, 32]               0
         QConv2d-161          [-1, 144, 32, 32]           3,456
    QBatchNorm2d-162          [-1, 144, 32, 32]             288
         QConv2d-163          [-1, 144, 16, 16]           1,296
    QBatchNorm2d-164          [-1, 144, 16, 16]             288
         QConv2d-165           [-1, 32, 16, 16]           4,608
    QBatchNorm2d-166           [-1, 32, 16, 16]              64
           Block-167           [-1, 32, 16, 16]               0
         QConv2d-168          [-1, 192, 16, 16]           6,144
    QBatchNorm2d-169          [-1, 192, 16, 16]             384
         QConv2d-170          [-1, 192, 16, 16]           1,728
    QBatchNorm2d-171          [-1, 192, 16, 16]             384
         QConv2d-172           [-1, 32, 16, 16]           6,144
    QBatchNorm2d-173           [-1, 32, 16, 16]              64
           Block-174           [-1, 32, 16, 16]               0
         QConv2d-175          [-1, 192, 16, 16]           6,144
    QBatchNorm2d-176          [-1, 192, 16, 16]             384
         QConv2d-177          [-1, 192, 16, 16]           1,728
    QBatchNorm2d-178          [-1, 192, 16, 16]             384
         QConv2d-179           [-1, 32, 16, 16]           6,144
    QBatchNorm2d-180           [-1, 32, 16, 16]              64
           Block-181           [-1, 32, 16, 16]               0
         QConv2d-182          [-1, 192, 16, 16]           6,144
    QBatchNorm2d-183          [-1, 192, 16, 16]             384
         QConv2d-184            [-1, 192, 8, 8]           1,728
    QBatchNorm2d-185            [-1, 192, 8, 8]             384
         QConv2d-186             [-1, 64, 8, 8]          12,288
    QBatchNorm2d-187             [-1, 64, 8, 8]             128
           Block-188             [-1, 64, 8, 8]               0
         QConv2d-189            [-1, 384, 8, 8]          24,576
    QBatchNorm2d-190            [-1, 384, 8, 8]             768
         QConv2d-191            [-1, 384, 8, 8]           3,456
    QBatchNorm2d-192            [-1, 384, 8, 8]             768
         QConv2d-193             [-1, 64, 8, 8]          24,576
    QBatchNorm2d-194             [-1, 64, 8, 8]             128
           Block-195             [-1, 64, 8, 8]               0
         QConv2d-196            [-1, 384, 8, 8]          24,576
    QBatchNorm2d-197            [-1, 384, 8, 8]             768
         QConv2d-198            [-1, 384, 8, 8]           3,456
    QBatchNorm2d-199            [-1, 384, 8, 8]             768
         QConv2d-200             [-1, 64, 8, 8]          24,576
    QBatchNorm2d-201             [-1, 64, 8, 8]             128
           Block-202             [-1, 64, 8, 8]               0
         QConv2d-203            [-1, 384, 8, 8]          24,576
    QBatchNorm2d-204            [-1, 384, 8, 8]             768
         QConv2d-205            [-1, 384, 8, 8]           3,456
    QBatchNorm2d-206            [-1, 384, 8, 8]             768
         QConv2d-207             [-1, 64, 8, 8]          24,576
    QBatchNorm2d-208             [-1, 64, 8, 8]             128
           Block-209             [-1, 64, 8, 8]               0
         QConv2d-210            [-1, 384, 8, 8]          24,576
    QBatchNorm2d-211            [-1, 384, 8, 8]             768
         QConv2d-212            [-1, 384, 8, 8]           3,456
    QBatchNorm2d-213            [-1, 384, 8, 8]             768
         QConv2d-214             [-1, 96, 8, 8]          36,864
    QBatchNorm2d-215             [-1, 96, 8, 8]             192
         QConv2d-216             [-1, 96, 8, 8]           6,144
    QBatchNorm2d-217             [-1, 96, 8, 8]             192
           Block-218             [-1, 96, 8, 8]               0
         QConv2d-219            [-1, 576, 8, 8]          55,296
    QBatchNorm2d-220            [-1, 576, 8, 8]           1,152
         QConv2d-221            [-1, 576, 8, 8]           5,184
    QBatchNorm2d-222            [-1, 576, 8, 8]           1,152
         QConv2d-223             [-1, 96, 8, 8]          55,296
    QBatchNorm2d-224             [-1, 96, 8, 8]             192
           Block-225             [-1, 96, 8, 8]               0
         QConv2d-226            [-1, 576, 8, 8]          55,296
    QBatchNorm2d-227            [-1, 576, 8, 8]           1,152
         QConv2d-228            [-1, 576, 8, 8]           5,184
    QBatchNorm2d-229            [-1, 576, 8, 8]           1,152
         QConv2d-230             [-1, 96, 8, 8]          55,296
    QBatchNorm2d-231             [-1, 96, 8, 8]             192
           Block-232             [-1, 96, 8, 8]               0
         QConv2d-233            [-1, 576, 8, 8]          55,296
    QBatchNorm2d-234            [-1, 576, 8, 8]           1,152
         QConv2d-235            [-1, 576, 4, 4]           5,184
    QBatchNorm2d-236            [-1, 576, 4, 4]           1,152
         QConv2d-237            [-1, 160, 4, 4]          92,160
    QBatchNorm2d-238            [-1, 160, 4, 4]             320
           Block-239            [-1, 160, 4, 4]               0
         QConv2d-240            [-1, 960, 4, 4]         153,600
    QBatchNorm2d-241            [-1, 960, 4, 4]           1,920
         QConv2d-242            [-1, 960, 4, 4]           8,640
    QBatchNorm2d-243            [-1, 960, 4, 4]           1,920
         QConv2d-244            [-1, 160, 4, 4]         153,600
    QBatchNorm2d-245            [-1, 160, 4, 4]             320
           Block-246            [-1, 160, 4, 4]               0
         QConv2d-247            [-1, 960, 4, 4]         153,600
    QBatchNorm2d-248            [-1, 960, 4, 4]           1,920
         QConv2d-249            [-1, 960, 4, 4]           8,640
    QBatchNorm2d-250            [-1, 960, 4, 4]           1,920
         QConv2d-251            [-1, 160, 4, 4]         153,600
    QBatchNorm2d-252            [-1, 160, 4, 4]             320
           Block-253            [-1, 160, 4, 4]               0
         QConv2d-254            [-1, 960, 4, 4]         153,600
    QBatchNorm2d-255            [-1, 960, 4, 4]           1,920
         QConv2d-256            [-1, 960, 4, 4]           8,640
    QBatchNorm2d-257            [-1, 960, 4, 4]           1,920
         QConv2d-258            [-1, 320, 4, 4]         307,200
    QBatchNorm2d-259            [-1, 320, 4, 4]             640
         QConv2d-260            [-1, 320, 4, 4]          51,200
    QBatchNorm2d-261            [-1, 320, 4, 4]             640
           Block-262            [-1, 320, 4, 4]               0
         QConv2d-263           [-1, 1280, 4, 4]         409,600
    QBatchNorm2d-264           [-1, 1280, 4, 4]           2,560
         QLinear-265                  [-1, 100]         128,100
     MobileNetV2-266                  [-1, 100]               0
================================================================
Total params: 4,824,424
Trainable params: 4,824,424
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 54.75
Params size (MB): 18.40
Estimated Total Size (MB): 73.16
----------------------------------------------------------------
