Files already downloaded and verified
Files already downloaded and verified
==> Resuming from checkpoint..
Ratio of nonzero value :  1.0
Number of nonzero value :  11210432
Number of value 11210432
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
           QConv2d-1           [-1, 64, 32, 32]           1,728
      QBatchNorm2d-2           [-1, 64, 32, 32]             128
              ReLU-3           [-1, 64, 32, 32]               0
         MaxPool2d-4           [-1, 64, 16, 16]               0
           QConv2d-5           [-1, 64, 16, 16]          36,864
      QBatchNorm2d-6           [-1, 64, 16, 16]             128
              ReLU-7           [-1, 64, 16, 16]               0
           QConv2d-8           [-1, 64, 16, 16]          36,864
      QBatchNorm2d-9           [-1, 64, 16, 16]             128
             ReLU-10           [-1, 64, 16, 16]               0
          QConv2d-11           [-1, 64, 16, 16]          36,864
     QBatchNorm2d-12           [-1, 64, 16, 16]             128
             ReLU-13           [-1, 64, 16, 16]               0
          QConv2d-14           [-1, 64, 16, 16]          36,864
     QBatchNorm2d-15           [-1, 64, 16, 16]             128
             ReLU-16           [-1, 64, 16, 16]               0
          QConv2d-17            [-1, 128, 8, 8]           8,192
     QBatchNorm2d-18            [-1, 128, 8, 8]             256
          QConv2d-19            [-1, 128, 8, 8]          73,728
     QBatchNorm2d-20            [-1, 128, 8, 8]             256
             ReLU-21            [-1, 128, 8, 8]               0
          QConv2d-22            [-1, 128, 8, 8]         147,456
     QBatchNorm2d-23            [-1, 128, 8, 8]             256
             ReLU-24            [-1, 128, 8, 8]               0
          QConv2d-25            [-1, 128, 8, 8]         147,456
     QBatchNorm2d-26            [-1, 128, 8, 8]             256
             ReLU-27            [-1, 128, 8, 8]               0
          QConv2d-28            [-1, 128, 8, 8]         147,456
     QBatchNorm2d-29            [-1, 128, 8, 8]             256
             ReLU-30            [-1, 128, 8, 8]               0
          QConv2d-31            [-1, 256, 4, 4]          32,768
     QBatchNorm2d-32            [-1, 256, 4, 4]             512
          QConv2d-33            [-1, 256, 4, 4]         294,912
     QBatchNorm2d-34            [-1, 256, 4, 4]             512
             ReLU-35            [-1, 256, 4, 4]               0
          QConv2d-36            [-1, 256, 4, 4]         589,824
     QBatchNorm2d-37            [-1, 256, 4, 4]             512
             ReLU-38            [-1, 256, 4, 4]               0
          QConv2d-39            [-1, 256, 4, 4]         589,824
     QBatchNorm2d-40            [-1, 256, 4, 4]             512
             ReLU-41            [-1, 256, 4, 4]               0
          QConv2d-42            [-1, 256, 4, 4]         589,824
     QBatchNorm2d-43            [-1, 256, 4, 4]             512
             ReLU-44            [-1, 256, 4, 4]               0
             ReLU-45            [-1, 256, 4, 4]               0
          QConv2d-46            [-1, 512, 2, 2]         131,072
     QBatchNorm2d-47            [-1, 512, 2, 2]           1,024
          QConv2d-48            [-1, 512, 2, 2]       1,179,648
     QBatchNorm2d-49            [-1, 512, 2, 2]           1,024
             ReLU-50            [-1, 512, 2, 2]               0
          QConv2d-51            [-1, 512, 2, 2]       2,359,296
     QBatchNorm2d-52            [-1, 512, 2, 2]           1,024
             ReLU-53            [-1, 512, 2, 2]               0
             ReLU-54            [-1, 512, 2, 2]               0
          QConv2d-55            [-1, 512, 2, 2]       2,359,296
     QBatchNorm2d-56            [-1, 512, 2, 2]           1,024
             ReLU-57            [-1, 512, 2, 2]               0
          QConv2d-58            [-1, 512, 2, 2]       2,359,296
     QBatchNorm2d-59            [-1, 512, 2, 2]           1,024
             ReLU-60            [-1, 512, 2, 2]               0
             ReLU-61            [-1, 512, 2, 2]               0
          QLinear-62                  [-1, 100]          51,200
         ResNet18-63                  [-1, 100]               0
          QConv2d-64           [-1, 64, 32, 32]           1,728
     QBatchNorm2d-65           [-1, 64, 32, 32]             128
             ReLU-66           [-1, 64, 32, 32]               0
        MaxPool2d-67           [-1, 64, 16, 16]               0
          QConv2d-68           [-1, 64, 16, 16]          36,864
     QBatchNorm2d-69           [-1, 64, 16, 16]             128
             ReLU-70           [-1, 64, 16, 16]               0
          QConv2d-71           [-1, 64, 16, 16]          36,864
     QBatchNorm2d-72           [-1, 64, 16, 16]             128
             ReLU-73           [-1, 64, 16, 16]               0
          QConv2d-74           [-1, 64, 16, 16]          36,864
     QBatchNorm2d-75           [-1, 64, 16, 16]             128
             ReLU-76           [-1, 64, 16, 16]               0
          QConv2d-77           [-1, 64, 16, 16]          36,864
     QBatchNorm2d-78           [-1, 64, 16, 16]             128
             ReLU-79           [-1, 64, 16, 16]               0
          QConv2d-80            [-1, 128, 8, 8]           8,192
     QBatchNorm2d-81            [-1, 128, 8, 8]             256
          QConv2d-82            [-1, 128, 8, 8]          73,728
     QBatchNorm2d-83            [-1, 128, 8, 8]             256
             ReLU-84            [-1, 128, 8, 8]               0
          QConv2d-85            [-1, 128, 8, 8]         147,456
     QBatchNorm2d-86            [-1, 128, 8, 8]             256
             ReLU-87            [-1, 128, 8, 8]               0
          QConv2d-88            [-1, 128, 8, 8]         147,456
     QBatchNorm2d-89            [-1, 128, 8, 8]             256
             ReLU-90            [-1, 128, 8, 8]               0
          QConv2d-91            [-1, 128, 8, 8]         147,456
     QBatchNorm2d-92            [-1, 128, 8, 8]             256
             ReLU-93            [-1, 128, 8, 8]               0
          QConv2d-94            [-1, 256, 4, 4]          32,768
     QBatchNorm2d-95            [-1, 256, 4, 4]             512
          QConv2d-96            [-1, 256, 4, 4]         294,912
     QBatchNorm2d-97            [-1, 256, 4, 4]             512
             ReLU-98            [-1, 256, 4, 4]               0
          QConv2d-99            [-1, 256, 4, 4]         589,824
    QBatchNorm2d-100            [-1, 256, 4, 4]             512
            ReLU-101            [-1, 256, 4, 4]               0
         QConv2d-102            [-1, 256, 4, 4]         589,824
    QBatchNorm2d-103            [-1, 256, 4, 4]             512
            ReLU-104            [-1, 256, 4, 4]               0
         QConv2d-105            [-1, 256, 4, 4]         589,824
    QBatchNorm2d-106            [-1, 256, 4, 4]             512
            ReLU-107            [-1, 256, 4, 4]               0
            ReLU-108            [-1, 256, 4, 4]               0
         QConv2d-109            [-1, 512, 2, 2]         131,072
    QBatchNorm2d-110            [-1, 512, 2, 2]           1,024
         QConv2d-111            [-1, 512, 2, 2]       1,179,648
    QBatchNorm2d-112            [-1, 512, 2, 2]           1,024
            ReLU-113            [-1, 512, 2, 2]               0
         QConv2d-114            [-1, 512, 2, 2]       2,359,296
    QBatchNorm2d-115            [-1, 512, 2, 2]           1,024
            ReLU-116            [-1, 512, 2, 2]               0
            ReLU-117            [-1, 512, 2, 2]               0
         QConv2d-118            [-1, 512, 2, 2]       2,359,296
    QBatchNorm2d-119            [-1, 512, 2, 2]           1,024
            ReLU-120            [-1, 512, 2, 2]               0
         QConv2d-121            [-1, 512, 2, 2]       2,359,296
    QBatchNorm2d-122            [-1, 512, 2, 2]           1,024
            ReLU-123            [-1, 512, 2, 2]               0
            ReLU-124            [-1, 512, 2, 2]               0
         QLinear-125                  [-1, 100]          51,200
        ResNet18-126                  [-1, 100]               0
================================================================
Total params: 22,440,064
Trainable params: 22,440,064
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 9.44
Params size (MB): 85.60
Estimated Total Size (MB): 95.05
----------------------------------------------------------------
